'use strict';
var letBorderWidth = 1; /*существует в коде еще до объявления*/

// EL6
let second = 2;/* работает только когда до переменной доходит,
не работает если заключен в {} скобкиБ
помогает при оптимизации*/

const pt = 1.14;/*неизменная переменная */

// Типы данных
// infinity - бесконечность
// NaN - не число
// null - то чего не существует
// undefined - когда объект существует, но значения не имеет
 
let obj = {}; /*- множество данных*/
let person = {
    name: "John",
    age: 13,
    sudim: true
};

// let arr = ['plum.png','orange.jpg','apple.php']


// console.log("obj" + "- obj");


// + - превращает строку в число
//  = - присваивание
//  == - сравнение
//  === - сравнение по типам данных
// && - и
// || - или
// ! - нет
// let incr = 10,
//     inx = 10;


// console.log(incr++);
// console.log(inx--);



